{"keras_version": "2.0.8", "backend": "tensorflow", "config": {"layers": [{"name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, 1], "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "embedding_1", "config": {"activity_regularizer": null, "embeddings_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "mask_zero": false, "embeddings_regularizer": null, "dtype": "float32", "batch_input_shape": [null, 1], "input_dim": 2187, "embeddings_constraint": null, "name": "embedding_1", "trainable": true, "output_dim": 100, "input_length": 1}, "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "reshape_1", "config": {"trainable": true, "target_shape": [100], "name": "reshape_1"}, "class_name": "Reshape", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"name": "input_3", "config": {"dtype": "float32", "batch_input_shape": [null, 53], "sparse": false, "name": "input_3"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "concatenate_1", "config": {"trainable": true, "axis": -1, "name": "concatenate_1"}, "class_name": "Concatenate", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["input_3", 0, 0, {}]]]}, {"name": "dense_1", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 100, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_1", "trainable": true, "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "input_2", "config": {"dtype": "float32", "batch_input_shape": [null, 2048], "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "input_4", "config": {"dtype": "float32", "batch_input_shape": [null, 2187], "sparse": false, "name": "input_4"}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "concatenate_2", "config": {"trainable": true, "axis": -1, "name": "concatenate_2"}, "class_name": "Concatenate", "inbound_nodes": [[["input_2", 0, 0, {}], ["dropout_1", 0, 0, {}], ["input_4", 0, 0, {}]]]}, {"name": "reshape_2", "config": {"trainable": true, "target_shape": [1, 4335], "name": "reshape_2"}, "class_name": "Reshape", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]]}, {"name": "gru_1", "config": {"recurrent_regularizer": null, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "units": 2048, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "gru_1", "recurrent_dropout": 0.0, "recurrent_constraint": null, "dropout": 0.0, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_regularizer": null, "implementation": 0, "unroll": false, "go_backwards": false, "trainable": true, "use_bias": true, "kernel_constraint": null}, "class_name": "GRU", "inbound_nodes": [[["reshape_2", 0, 0, {}]]]}, {"name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["gru_1", 0, 0, {}]]]}, {"name": "dense_2", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 2048, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_2", "trainable": true, "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "batch_normalization_1", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_1", "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "activation_1", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "multiply_1", "config": {"trainable": true, "name": "multiply_1"}, "class_name": "Multiply", "inbound_nodes": [[["input_2", 0, 0, {}], ["activation_1", 0, 0, {}]]]}, {"name": "concatenate_3", "config": {"trainable": true, "axis": -1, "name": "concatenate_3"}, "class_name": "Concatenate", "inbound_nodes": [[["multiply_1", 0, 0, {}], ["dropout_1", 0, 0, {}], ["input_4", 0, 0, {}]]]}, {"name": "reshape_3", "config": {"trainable": true, "target_shape": [1, 4335], "name": "reshape_3"}, "class_name": "Reshape", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]]}, {"name": "gru_2", "config": {"recurrent_regularizer": null, "activation": "tanh", "activity_regularizer": null, "bias_constraint": null, "units": 1024, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "return_state": false, "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "gru_2", "recurrent_dropout": 0.0, "recurrent_constraint": null, "dropout": 0.0, "return_sequences": false, "recurrent_activation": "hard_sigmoid", "stateful": false, "kernel_regularizer": null, "implementation": 0, "unroll": false, "go_backwards": false, "trainable": true, "use_bias": true, "kernel_constraint": null}, "class_name": "GRU", "inbound_nodes": [[["reshape_3", 0, 0, {}]]]}, {"name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "rate": 0.25}, "class_name": "Dropout", "inbound_nodes": [[["gru_2", 0, 0, {}]]]}, {"name": "dense_3", "config": {"activation": "linear", "activity_regularizer": null, "bias_constraint": null, "units": 2187, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "dense_3", "trainable": true, "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"name": "batch_normalization_2", "config": {"epsilon": 0.001, "axis": -1, "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "scale": true, "beta_constraint": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_regularizer": null, "gamma_regularizer": null, "name": "batch_normalization_2", "center": true, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}}, "class_name": "BatchNormalization", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "activation_2", "config": {"trainable": true, "name": "activation_2", "activation": "softmax"}, "class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}], "output_layers": [["activation_2", 0, 0]], "input_layers": [["input_2", 0, 0], ["input_1", 0, 0], ["input_3", 0, 0], ["input_4", 0, 0]], "name": "model_1"}, "class_name": "Model"}